In [ ]:
## 練習に使うデータを取得
!wget https://www.nysol.jp/nysol_python/_downloads/610138a8b5d1260d3bc540f9d4e20d60/yakiniku_jp.csv

--2021-01-03 09:45:40--  https://www.nysol.jp/nysol_python/_downloads/610138a8b5d1260d3bc540f9d4e20d60/yakiniku_jp.csv
Resolving www.nysol.jp (www.nysol.jp)... 49.212.235.67
Connecting to www.nysol.jp (www.nysol.jp)|49.212.235.67|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 5698013 (5.4M) [text/csv]
Saving to: ‘yakiniku_jp.csv’

yakiniku_jp.csv     100%[===================>]   5.43M  1.70MB/s    in 3.2s

2021-01-03 09:45:44 (1.70 MB/s) - ‘yakiniku_jp.csv’ saved [5698013/5698013]

In [ ]:
import pandas as pd
df = pd.read_table('yakiniku_jp.csv', delimiter=',')

In [ ]:
df.head(3)

       date    time  receipt  itemID          item  price  quantity
0  20070701  115200     5589     107        和牛焼肉弁当   1240         1
1  20070701  122800     5594     102          冷麺定食   1130         2
2  20070701  120800     5595     105  オリジナル３品盛り合わせ    880         1

In [ ]:
df.loc[:, ["date", "time"]]

            date    time
0       20070701  115200
1       20070701  122800
2       20070701  120800
3       20070701  120800
4       20070701  122600
...          ...     ...
108242  20081014  210300
108243  20081014  210300
108244  20081014  210300
108245  20081014  210300
108246  20081014  210300

[108247 rows x 2 columns]

In [ ]:
df.loc[:, ["date", "time"]].head(3)

       date    time
0  20070701  115200
1  20070701  122800
2  20070701  120800

In [ ]:
df.loc[:, ["date", "time"]].tail(3)

            date    time
108244  20081014  210300
108245  20081014  210300
108246  20081014  210300

In [ ]:
# 検索
df.query('price == 880').head(3)

         date    time  receipt  itemID          item  price  quantity
2    20070701  120800     5595     105  オリジナル３品盛り合わせ    880         1
421  20070702  122700     5651     105  オリジナル３品盛り合わせ    880         1
424  20070702  121500     5653     105  オリジナル３品盛り合わせ    880         1

In [ ]:
# 検索結果に対して、列選択
df.query('price < 1000').loc[:, ["time", "item"]].head(3)

      time          item
2   120800  オリジナル３品盛り合わせ
16  135400        生レバー刺身
18  174700        生レバー刺身

In [ ]:
# 検索 (or)
df.query('price < 1000 or time > 170000').head(3)

        date    time  receipt  itemID          item  price  quantity
2   20070701  120800     5595     105  オリジナル３品盛り合わせ    880         1
16  20070701  135400     5601     403        生レバー刺身    890         1
17  20070701  174700     5604     401         炙り牛刺し   1040         1

In [ ]:
# 検索 (and)
df.query('price < 1000 and time > 170000').head(3)

        date    time  receipt  itemID    item  price  quantity
18  20070701  174700     5604     403  生レバー刺身    890         1
19  20070701  172500     5605     403  生レバー刺身    890         1
20  20070701  172500     5605     404     ユッケ    890         1

In [ ]:
# ソート

#昇順
ret_df = df.query('price < 1000 and time > 170000').sort_values(by=['price'], ascending=True)
ret_df.head(3)

#降順
ret_df = df.query('price < 1000 and time > 170000').sort_values(by=['price'], ascending=False)
ret_df.head(3)

           date    time  receipt  itemID     item  price  quantity
46592  20080104  185900     4396     651  いわて牛上バラ    990         1
27603  20071013  193900      461     651  いわて牛上バラ    990         1
6771   20070729  201700     6771     651  いわて牛上バラ    990         2

In [ ]:
# パターンマッチング(部分一致)

#df.query('item.str.startswith("ビール")', engine='python')
#df.query('item.str.endswith("ビール")', engine='python')
df.query('item.str.contains("ビール")', engine='python')

            date    time  receipt  itemID    item  price  quantity
319     20070701  115100     5593    2106  ランチビール    240         2
320     20070701  115600     5599    2106  ランチビール    240         2
321     20070701  174400     5604    2101   生ビール中    460         1
322     20070701  170800     5606    2101   生ビール中    460         4
323     20070701  182400     5607    2101   生ビール中    460         1
...          ...     ...      ...     ...     ...    ...       ...
108210  20081014  183500     6864    2101   生ビール中    460         2
108211  20081014  191100     6865    2102   生ビール小    270         3
108212  20081014  203400     6866    2101   生ビール中    460         1
108213  20081014  205600     6866    2102   生ビール小    270         1
108214  20081014  205600     6867    2101   生ビール中    460         5

[7278 rows x 7 columns]

In [ ]:
# 集合関数

ret_df_sum = df['price'].sum()
ret_df_avg = df['price'].mean()
ret_df_min = df['price'].min()
ret_df_max = df['price'].max()
ret_df_count = len(df)
ret_df_count_distinct = len(df['item'].unique())

print(ret_df_sum)
print(ret_df_avg)
print(ret_df_min)
print(ret_df_max)
print(ret_df_count)
print(ret_df_count_distinct)

91772640
847.8076990586344
0
6690
108247
793

In [ ]:
# 通常検索 in演算子
df.query('price > 4900 and date in (20070701, 20081009)')

            date    time  receipt  itemID           item  price  quantity
120     20070701  171300     5606     685       ファミリーセット   5520         1
126     20070701  180600     5609     685       ファミリーセット   5520         1
129     20070701  181300     5610     685       ファミリーセット   5520         1
160     20070701  183100     5618     684  オリジナル盛り合わせセット   4980         1
163     20070701  183800     5619     684  オリジナル盛り合わせセット   4980         1
106420  20081009  183000     6616     929    本日の最高の盛り合わせ   4910         1
106421  20081009  184000     6617     929    本日の最高の盛り合わせ   4910         1
106422  20081009  184000     6618     929    本日の最高の盛り合わせ   4910         1

In [ ]:
df.query('date >= 20070701 and date <= 20070809')

          date    time  receipt  itemID          item  price  quantity
0     20070701  115200     5589     107        和牛焼肉弁当   1240         1
1     20070701  122800     5594     102          冷麺定食   1130         2
2     20070701  120800     5595     105  オリジナル３品盛り合わせ    880         1
3     20070701  120800     5595     107        和牛焼肉弁当   1240         1
4     20070701  122600     5596     107        和牛焼肉弁当   1240         1
...        ...     ...      ...     ...           ...    ...       ...
9540  20070809  183900     7203    4135        ・ソーダ割り      0         1
9541  20070809  201100     7208    4132          ・水割り      0         1
9542  20070809  204300     7208    4135        ・ソーダ割り      0         2
9543  20070809  210100     7208    4131          ・ロック      0         1
9544  20070809  222600     7209    4132          ・水割り      0         2

[9545 rows x 7 columns]

In [ ]:
# 文字列を含む検索
ret_df = df.query('item == "ファミリーセット"')
ret_df.head(3)

         date    time  receipt  itemID      item  price  quantity
120  20070701  171300     5606     685  ファミリーセット   5520         1
126  20070701  180600     5609     685  ファミリーセット   5520         1
129  20070701  181300     5610     685  ファミリーセット   5520         1

In [ ]:
%%time
ret_df = df.groupby("date").mean().loc[:, ["price"]]

CPU times: user 10.2 ms, sys: 1.92 ms, total: 12.1 ms
Wall time: 14.8 ms

In [ ]:
ret_df.head(3)

               price
date
20070701  827.002398
20070702  929.411765
20070703  984.915254

In [ ]:
df_mean = df.groupby("date").mean()
df_mean.query("price > 1000").loc[:, ["price"]]
#df_mean.loc[:, ["price"]]

                price
date
20070724  1138.373016
20070725  1006.656805
20070726  1018.160000
20070903  1029.344262
20071016  1013.809524
20071017  1028.805970
20071024  1024.552239
20071105  1010.101010
20071207  1008.837209
20071231  1024.285714
20080516  1015.967742
20080714  1035.054945

In [ ]:
!cat yakiniku_jp.csv | grep "20070701" | wc -l

417

In [ ]:
from sqlalchemy import create_engine
engine = create_engine('sqlite://', echo=False)

In [ ]:
df.to_sql('yakiniku', con=engine)

In [ ]:
%%time
ret = engine.execute("SELECT date, avg(price) FROM yakiniku group by date").fetchall()

CPU times: user 52.1 ms, sys: 2.73 ms, total: 54.8 ms
Wall time: 57.2 ms

In [ ]:
ret[:3]

[(20070701, 827.0023980815348),
 (20070702, 929.4117647058823),
 (20070703, 984.9152542372881)]

In [ ]:
# 重複削除(distinct)
df[~df.duplicated(subset=['date', 'item'])].loc[:, ["date", "item"]]

            date          item
0       20070701        和牛焼肉弁当
1       20070701          冷麺定食
2       20070701  オリジナル３品盛り合わせ
5       20070701       石焼ビビンバ膳
6       20070701  いわて和牛しゃぶしゃぶ膳
...          ...           ...
108242  20081014      厳選リブロース２
108243  20081014        上トモカルビ
108244  20081014      上霜降トモカルビ
108245  20081014  骨付き上霜降りトモカルビ
108246  20081014         秋のキノコ

[46230 rows x 2 columns]

## INSERRT

In [ ]:
import pandas as pd

In [ ]:
import pandas as pd

df = pd.DataFrame({'A': ['A1', 'A2', 'A3'],
                   'B': ['B1', 'B2', 'B3'],
                   'C': ['C1', 'C2', 'C3']})

In [ ]:
df

    A   B   C
0  A1  B1  C1
1  A2  B2  C2
2  A3  B3  C3

In [ ]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [ ]:
s = pd.Series(['A4', 'B4', 'C4'], index=['A', 'B', 'C'], name=3)
s

A    A4
B    B4
C    C4
Name: 3, dtype: object

In [ ]:
# igonore_Indexで元の行番号が無視される
df_inserted = df.append(s)
#del df
df_inserted

    A   B   C
0  A1  B1  C1
1  A2  B2  C2
2  A3  B3  C3
3  A4  B4  C4

In [ ]:
s = pd.Series(['A4', 'B4', 'C4'], index=df.columns, name=4)
df.append(s)

     A    B    C    0    1    2
0   A1   B1   C1  NaN  NaN  NaN
1   A2   B2   C2  NaN  NaN  NaN
2   A3   B3   C3  NaN  NaN  NaN
4  NaN  NaN  NaN   A4   B4   C4

In [ ]:
# 複数のレコードを登録
df2 = pd.DataFrame([['A6', 'B6', 'C6'], ['A7', 'B7', 'C7']], 
                   columns=['A', 'B', 'C'])
df.append(df2, ignore_index=True)

    A   B   C
0  A1  B1  C1
1  A2  B2  C2
2  A3  B3  C3
3  A6  B6  C6
4  A7  B7  C7

In [ ]:
# INSERT文 (select文の結果をinsertする)
df.append(df2.query('A=="A6"'), ignore_index=True)

    A   B   C
0  A1  B1  C1
1  A2  B2  C2
2  A3  B3  C3
3  A6  B6  C6

In [ ]:
import pandas as pd

df = pd.DataFrame([['A0', 'B0']],
                    columns=['COL1', 'COL2'])

df2 = pd.DataFrame([['A1', 'B1'], ['A2', 'B2'], ['A3', 'B3']],
                    columns=['COL1', 'COL2'])
print(df)
# COL1 COL2
# 0   A0   B0
print(df2)
# COL1 COL2
#0   A1   B1
#1   A2   B2
#2   A3   B3

print(df.append(df2)) 
# COL1 COL2
#0   A0   B0
#0   A1   B1
#1   A2   B2
#2   A3   B3

print(df.append(df2, ignore_index=True))
#  COL1 COL2
#0   A0   B0
#1   A1   B1
#2   A2   B2
#3   A3   B3

--df--
  COL1 COL2
0   A0   B0
  COL1 COL2
0   A1   B1
1   A2   B2
2   A3   B3
  COL1 COL2
0   A0   B0
0   A1   B1
1   A2   B2
2   A3   B3
  COL1 COL2
0   A0   B0
1   A1   B1
2   A2   B2
3   A3   B3